Repository: makise-homura/syncp
Catalog: po/*.po
Languages: ru

source: Try '%s --help' for more information.
ru: Выполните '%s --help' для получения справки.

source: Usage: %s [OPTION] [FILE]...
ru: Использование: %s [ОПЦИЯ] [ФАЙЛ]...

source: Synchronize cached writes to persistent storage If one or more files are specified, sync only them, or their containing file systems. When syncing, display size of remaining data to sync.
ru: Синхронизирует кэшированные запросы на постоянные носители Если указаны один или несколько файлов, то синхронизирует только их, или файловые системы, где они расположены. В процессе синхронизации показывает, сколько ещё осталось синхронизировать.

source: -d, --data sync only file data, no unneeded metadata
ru: -d, --data синхронизировать только данные, без метаданных

source: -f, --file-system sync the file systems that contain the files
ru: -f, --file-system синхронизировать файловые системы, содержащие файлы

source: -t, --timeout N timeout (in seconds) when to exit if sync still not finished
ru: -t, --timeout N таймаут (в секундах), после которого выйти, даже если синхронизация не завершена

source: -p, --period N period (in seconds) to check buffers size
ru: -p, --period N период (в секундах) для проверки размера буферов

source: -h, --help display this help and exit
ru: -h, --help показать эту справку и выйти

source: -v, --version output version information and exit
ru: -v, --version показать версию и выйти

source: error opening "%s"
ru: невозможно открыть "%s"

source: couldn't reset non-blocking mode "%s"
ru: невозможно сбросить неблокирующий режим "%s"

source: error syncing "%s"
ru: ошибка синхронизации "%s"

source: failed to close "%s"
ru: невозможно закрыть "%s"

source: wrong timeout argument %s
ru: неверный таймаут: %s

source: wrong period argument %s
ru: неверный период: %s

source: %s version %s
ru: %s, версия %s

source: cannot specify both --data and --file-system
ru: нельзя задавать одновременно --data и --file-system

source: --data needs at least one argument
ru: --data требует как минимум один аргумент

source: can't register signal handler
ru: невозможно зарегистрировать обработчик сигнала

source: unknown
ru: неизвестно

source: %cDirty: %s, Writeback: %s, processes: %d
ru: %cНе записано: %s, записывается: %s, процессов осталось: %d

source: timeout is exceeded, probably still syncing
ru: таймаут превышен, возможно, всё ещё синхронизируемся

source: can't sync some data
ru: невозможно синхронизировать какие-то данные
